In [1]:
import pandas as pd
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.shape

(891, 15)

In [7]:
df2 = df[['survived','pclass','age','parch']]
df2.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [8]:
df2.isnull().sum().sum()

177

In [9]:
df3 = df2.fillna(df2.mean())

In [10]:
df3.isnull().sum().sum()

0

In [11]:
df3.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [12]:
df3.shape

(891, 4)

In [13]:
# Now we have to split data in two X(Indep var) and y(Dep var)

In [15]:
X = df3.drop('survived', axis =1)
y = df3['survived']

In [18]:
X.shape # X is in capital => In ML Cap X denotes matrix

(891, 3)

In [19]:
y.shape # small y denotes vector

(891,)

In [20]:
# Now split data in test and in train data set

In [21]:
from sklearn.model_selection import train_test_split

In [31]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2,random_state =51)
print('Shape of X-train: ',X_train.shape)
print('Shape of X-test: ',X_test.shape)
print('Shape of y-train: ',y_train.shape)
print('Shape of y-test: ',y_test.shape)

Shape of X-train:  (712, 3)
Shape of X-test:  (179, 3)
Shape of y-train:  (712,)
Shape of y-test:  (179,)

In [32]:
X_train

     pclass        age  parch
770       3  24.000000      0
152       3  55.500000      0
731       3  11.000000      0
775       3  18.000000      0
324       3  29.699118      2
..      ...        ...    ...
528       3  39.000000      0
709       3  29.699118      1
736       3  48.000000      3
485       3  29.699118      1
57        3  28.500000      0

[712 rows x 3 columns]